#ifndef __SBI_EXT_HANG_H
#define __SBI_EXT_HANG_H

//此文件是用户可以调用的API头文件
//包含了系统挂起扩展的SBI调用的C形式的接口
//同时具体定义了对返回值结构体sbi_ret_t 中的value 的解释
//以及一些系统挂起扩展需要传入参数的宏定义解释

#include "sbi.h"

/**************************************************************************************************************************************
 * function     :   sbsbi_system_suspend                                                                                              *
 * description  :   系统挂起                                                                                                           *
 * param        :   sleep_type    -> 系统睡眠类型                                                                                      *
 *                  resume_addr   -> 指向监督者模式的入口点地址，指向恢复后执行的指令地址                                                *                         
 *                  opaque        -> 一个XLEN位的值，当hart恢复执行时，将被设置在a1寄存器中                                              *
 * return       :   sbi_ret_t.error  ->错误码                                                                                          *
 *                  sbi_ret_t.value  ->无意义                                                                                          *
 ***********************************************************解释************************************************************************
 *          返回值中 sbi_ret_t.value.error 对应解释                                                                                     *
 ***************************************************************************************************************************************
 *   SBI_SUCCESS：系统已成功暂停并成功恢复                                                                                              *
 *   SBI_ERR_INVALID_PARAM：sleep_type是平台特定/未实现/保留的                                                                          *
 *   SBI_ERR_NOT_SUPPORTED：sleep_type已经实现，但由于依赖项缺失，平台不支持                                                             *
 *   SBI_ERR_INVALID_ADDRESS：resume_addr无效，可能是由于以下原因：                                                                     *
 *      (1)不是一个有效的物理地址                                                                                                       *
 *      (2)该地址有效，但访问被物理内存保护机制或监督者模式的 H-扩展 G-阶段所禁止                                                         *
 *   SBI_ERR_FAILED：暂停请求，因未指明或未知的其他原因而失败                                                                            *
 ***************************************************************************************************************************************
 *  系统恢复时寄存器的状态：                                                                                                            *
 *         寄存器名称	                               寄存器值                                                                         *
 *            satp	                                      0                                                                            *
 *         sstatus.SIE	                                  0                                                                            *
 *             a0	                                    hartid                                                                         *
 *             a1	                                 opaque parameter                                                                  *
*************************宏定义**********************************************************************************************************
*                           传入参数sleep_type对应的意义                                                                                 *
****************************************************************************************************************************************/
#define SUSPEND_TO_RAM 0
sbi_ret_t sbsbi_system_suspend(uint32_t sleep_type,   unsigned long resume_addr,   unsigned long opaque);


#endif