#ifndef __SBI_EXT_BASE_H
#define __SBI_EXT_BASE_H

//此文件是用户可以调用的API头文件
//包含了hart状态管理扩展的SBI调用的C形式的接口
//同时具体定义了对返回值结构体sbi_ret_t 中的value 和error的解释
//以及一些hart状态管理扩展需要传入参数的宏定义解释

#include "sbi.h"


/**************************************************************************************************************************************
 * function     :   sbi_hart_start                                                                                                    *
 * description  :   以特定的寄存器值在指定的start_addr地址处启动执行目标hart的监督者模式                                                  *                                 
 * param        :   hartid        -> 指定启动的目标 hart                                                                               *
 *                  start_addr    -> 指向一个运行时指定的物理地址                                                                       *
 *                  opaque        -> 一个XLEN位的值，当hart在start_addr处开始执行时，opaque参数被设置在a1寄存器中                        *                                                 
 * return       :   sbi_ret_t.error  ->错误码                                                                                          *
 *                  sbi_ret_t.value  ->无意义                                                                                          *
 ***********************************************************解释************************************************************************
 *          返回值中 sbi_ret_t.value.error 对应解释                                                                                     *
 ***************************************************************************************************************************************
 *  SBI_SUCCESS	            成功启动，从start_addr开始执行                                                                              *
 *  SBI_ERR_INVALID_ADDRESS 非法地址，start_addr 无效，原因可能如下：无效物理地址，该地址被 PMP 禁止在监督者模式下执行                     *                                                           
 *  SBI_ERR_INVALID_PARAM	非法参数，无效的hart，其相应的hart不能以监督者模式启动                                                        *
 *  SBI_ERR_ALREADY_AVAILAB 给定 hartid 已启动                                                                                          *
 *  SBI_ERR_FAILED          启动失败，未知原因造成启动失败                                                                               *
 ***************************************************************************************************************************************
 ***************************************************************************************************************************************
 *  系统启动时寄存器的状态：                                                                                                            *
 *         寄存器名称	                               寄存器值                                                                         *
 *            satp	                                      0                                                                            *
 *         sstatus.SIE	                                  0                                                                            *
 *             a0	                                    hartid                                                                         *
 *             a1	                                  opaque 参数                                                                      *
*************************宏定义**********************************************************************************************************/
sbi_ret_t  sbi_hart_start(unsigned  long  hartid, unsigned long start_addr, unsigned long opaque);




/**************************************************************************************************************************************
 * function     :   sbi_hart_stop                                                                                                     *
 * description  :   停止以监督者模式执行调用hart ，必须在禁用监督者模式中断时调用                                                         *                                 
 * param        :   无                                                                                                                 *                                                 
 * return       :   sbi_ret_t.error  ->错误码                                                                                          *
 *                  sbi_ret_t.value  ->无意义                                                                                          *
 ***********************************************************解释************************************************************************
 *          返回值中 sbi_ret_t.value.error 对应解释                                                                                     *
 ***************************************************************************************************************************************                                                                                    
 *  SBI_ERR_FAILED          当前hard的停止操作执行失败                                                                                  *
 ***************************************************************************************************************************************/
sbi_ret_t  sbi_hart_stop(void);




/**************************************************************************************************************************************
 * function     :   sbi_hart_get_status                                                                                               *
 * description  :   获取给定hartid的当前状态                                                                                            *                                 
 * param        :   hardid        -> 指定需要查询状态的hart                                                                             *                                                 
 * return       :   sbi_ret_t.error  ->错误码                                                                                          *
 *                  sbi_ret_t.value  ->hard状态                                                                                        *
 ***********************************************************解释************************************************************************
 *          返回值中 sbi_ret_t.value.error 对应解释                                                                                     *
 ***************************************************************************************************************************************                                                                                    
 *  SBI_ERR_INVALID_PARAM   无效参数，给定的hartid无效                                                                                  *
 ***************************************************************************************************************************************
 *          返回值中 sbi_ret_t.value.value 对应解释                                                                                      *
 ***************************************************************************************************************************************
 *   状态ID	       状态名	                                                                                                            *
 *    0	           启动	                                                                                                                *
 *    1	           结束	                                                                                                                *
 *    2	         等待被启动	                                                                                                             *
 *    3	          结束等待	                                                                                                             *
 *    4	           挂起	                                                                                                                 *
 *    5	          等待挂起	                                                                                                             *
 *    6	          等待恢复 	                                                                                                             *
 ***************************************************************************************************************************************/
sbi_ret_t  sbi_hart_get_status(unsigned long hartid);




/**************************************************************************************************************************************
 * function     :   sbi_hart_suspend                                                                                                   *
 * description  :   将hart置于由suspend_type参数指定的平台特定的挂起状态                                                                 *                                 
 * param        :   suspend_type  -> hart挂起类型                                                                                      *
 *                  resume_addr   -> 恢复执行运行时指定的物理地址                                                                       *
 *                  opaque        -> 一个XLEN位的值，当hart在resume_addr处开始执行时，opaque参数被设置在a1寄存器中                        *                                                 
 * return       :   sbi_ret_t.error  ->错误码                                                                                          *
 *                  sbi_ret_t.value  ->无意义                                                                                          *
 ***********************************************************解释************************************************************************
 *          返回值中 sbi_ret_t.value.error 对应解释                                                                                     *
 ***************************************************************************************************************************************
 *  SBI_SUCCESS	            hart成功地从保持性挂起状态中恢复。                                                                          *
 *  SBI_ERR_INVALID_ADDRESS 非法地址，resume_addr无效，可能原因：无效的物理地址或该地址被 PMP 禁止在监督者模式下运行                       *                                                           
 *  SBI_ERR_INVALID_PARAM	无效参数，suspend_type 无效                                                                                *
 *  SBI_ERR_NOT_SUPPORTED   不支持，suspend_type有效但未实现                                                                            *
 *  SBI_ERR_FAILED          挂起请求因未知原因而失败。                                                                                  *
 ***************************************************************************************************************************************
 ***************************************************************************************************************************************
 *  恢复运行时寄存器的状态：                                                                                                            *
 *         寄存器名称	                               寄存器值                                                                         *
 *            satp	                                      0                                                                            *
 *         sstatus.SIE	                                  0                                                                            *
 *             a0	                                    hartid                                                                         *
 *             a1	                                  opaque 参数                                                                      *
*************************宏定义**********************************************************************************************************/
sbi_ret_t  sbi_hart_suspend(uint32_t suspend_type, unsigned long resume_addr, unsigned long opaque);



#endif